rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC
---
  def index

    sort_choice = params[:sort] || session[:sort]

    if sort_choice == 'title'
      @movies = Movie.order('title ASC')
      @title_hilite = 'hilite'
    elsif sort_choice == 'release_date'
      @movies = Movie.order('release_date ASC')
      @release_date_hilite = 'hilite'
    end

    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
    end

    if sort_choice != session[:sort] || @selected_ratings != session[:ratings]
      session[:sort] = sort_choice
      session[:ratings] = @selected_ratings
      redirect_to :sort => sort_choice, :ratings => @selected_ratings and return
    end
    @movies = Movie.where(rating: @selected_ratings.keys).order(sort_choice)